app/controllers/creatures_controller.rb

  def index
    @creatures = Creature.all
---
SELECT "creatures".* FROM "creatures"

  def create
    @creature = Creature.create(creature_params)
---
INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Tinkerbell"], ["description", "Fairy"], ["created_at", "2015-04-28 16:55:14.763098"], ["updated_at", "2015-04-28 16:55:14.763098"]]

  def show
    @creature = Creature.find(params[:id])
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 0]]